{
  "index.html": "Single-page app host; mounts the React app at <div id=\"root\"> and loads /src/main.tsx.",
  "package.json": "NPM manifest with scripts (dev/build/preview/test) and dependencies (React, Vite, Tailwind, etc.).",
  "vite.config.ts": "Vite configuration; sets up React plugin and dev server port.",
  "vitest.config.ts": "Vitest configuration for JS DOM testing environment.",
  "tsconfig.json": "TypeScript compiler options and project include paths (src).",
  "postcss.config.js": "PostCSS pipeline configuration that wires Tailwind + autoprefixer.",
  "tailwind.config.js": "Tailwind theme tokens, colors, fonts and content globs for class generation.",
  "README.md": "Project overview, local-first design notes, and quick start instructions.",
  "src/main.tsx": "React entry point; renders <App /> and imports src/index.css.",
  "src/index.css": "Primary stylesheet entry (Tailwind layers + project fallbacks); contains theme tokens, layout fallbacks and icon size constraints.",
  "src/styles.css": "Legacy / alternate stylesheet. Historically the app used this file; kept for fallback.",
  "src/App.tsx": "Main app composition: ThemeProvider, SettingsSidebar, Header, PostGenerator and StyleLibrary layout used in the app shell.",
  "src/App_new.tsx": "Alternative/simpler App variant using Layout and PostGenerator (experimental or refactor copy).",
  "src/context/ThemeContext.tsx": "Provides theme/tone/font-scale/custom color state and applies .dark and CSS variables to the document element.",
  "src/components/Button.tsx": "Small variant-aware button component (primary/secondary) wrapper used across the UI.",
  "src/components/Card.tsx": "Generic card container for panels and grouped content.",
  "src/components/Header.tsx": "Top header bar with app title and small subtext; contains New Post button.",
  "src/components/Layout.tsx": "Page shell that provides a fixed header and padded main area (used by App_new).",
  "src/components/Input.tsx": "Reusable single-line input field with label and error display.",
  "src/components/TextArea.tsx": "Reusable textarea with label, sizing and error support.",
  "src/components/PostEditor.tsx": "Editor component that ties generation, scoring (engagement/toxicity) and hashtag suggestions into an editing UI.",
  "src/components/PostGenerator.tsx": "Main post generation UI (controls tone, audience, generator call) and shows metrics; contains Generate / Copy / Share buttons.",
  "src/components/PostGenerator_new.tsx": "More feature-rich generator variant with presets, saved preferences, Tone intensity slider and copy/export controls.",
  "src/components/EnhancedPostGenerator.tsx": "Experimental generator UI that simulates enhancement flows and templates and includes metric bars and suggestions.",
  "src/components/LinkedINPostBuilder.tsx": "Post builder/preview component with templates, write/enhance modes and copy to clipboard actions.",
  "src/components/StyleLibrary.tsx": "Style library UI that uses IndexedDB (via vectorStore) to save and browse example posts; exposes Use This and delete actions.",
  "src/components/SettingsSidebar.tsx": "Settings sidebar for theme, tone, font-scale and custom colors; reads/writes ThemeContext.",
  "src/components/HashtagDisplay.tsx": "Small UI to render hashtags as clickable/chip elements.",
  "src/components/MetricsPanel.tsx": "Panel that shows metric gauges and quick tips; renders engagement/impact/relevance visualizations.",
  "src/components/MetricIndicator.tsx": "Small bar indicator component used to render individual metrics (label + percent progress bar).",
  "src/services/localGenerator.ts": "Lightweight local generator adapter (stub); returns a template-based draft and simulates latency.",
  "src/services/PostGenerationService.ts": "Orchestrates enhancement flow: calls RAGService, enhancedGenerator, formatting and metrics analysis; returns final content + metrics.",
  "src/services/RAGService.ts": "Simple in-memory retrieval (TF-style token counts) returning similar example texts from examples.json.",
  "src/services/vectorStore.ts": "IndexedDB wrapper (idb) for saving/retrieving example posts and simple retrieval placeholder.",
  "src/services/hashtagSuggester.ts": "Heuristic hashtag suggester that extracts frequent tokens and returns hashtag candidates.",
  "src/services/engagementPredictor.ts": "Heuristic engagement scoring function (0.0-1.0); placeholder for a client-side model.",
  "src/services/toxicityChecker.ts": "Simple toxicity heuristic (counts bad words); placeholder for on-device safety model.",
  "src/utils/postFormatting.ts": "Utilities for formatting/validating LinkedIn posts: format, enforce length, and add hashtags.",
  "src/utils/enhancedGenerator.ts": "Deterministic post enhancer with hook/structure/CTA/hashtag helpers used by the generation service.",
  "src/data/examples.json": "Example post texts used by the in-browser RAG style library.",
  "ml/": "Python training scripts and artifacts for engagement predictor and vectorizer; artifacts under ml/artifacts/.",
  "served_index_css.txt": "Debug artifact: copy of the CSS module served by Vite during debugging.",
  "vite_page.html": "Saved copy of the dev server's served page HTML used for offline inspection.",
  "FILE_DESCRIPTIONS.md": "This document — one-line summaries and snippet previews for files in the repo."
}
